gicking/STM8_headers/SVD/STM8AL3L48.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DM</name>
      <baseAddress>0x7F90</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>11</size>
        <usage>registers</usage>
      </addressBlock>
      <description>DM</description>
      <groupName>DM</groupName>
      <registers>
        <register>
          <name>BK1RE</name>
          <description>DM breakpoint 1 register extended byte</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK1RH</name>
          <description>DM breakpoint 1 register high byte</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK1RL</name>
          <description>DM breakpoint 1 register low byte</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RE</name>
          <description>DM breakpoint 2 register extended byte</description>
          <size>8</size>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RH</name>
          <description>DM breakpoint 2 register high byte</description>
          <size>8</size>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RL</name>
          <description>DM breakpoint 2 register low byte</description>
          <size>8</size>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>CR1</name>
          <description>DM Debug module control register 1</description>
          <size>8</size>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>CR2</name>
          <description>DM Debug module control register 2</description>
          <size>8</size>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>CSR1</name>
          <description>DM Debug module control/status register 1</description>
          <size>8</size>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x10</resetValue>
        </register>
        <register>
          <name>CSR2</name>
          <description>DM Debug module control/status register 2</description>
          <size>8</size>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>ENFCTR</name>
          <description>DM enable function register</description>
          <size>8</size>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
      </registers>
      <interrupt>
        <name>DM_DMA1_CH0_HT_DMA1_CH0_TC_DMA1_CH1_HT_DMA1_CH1_TC</name>
        <description>DM_DMA1_CH0_HT_DMA1_CH0_TC_DMA1_CH1_HT_DMA1_CH1_TC interrupt</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DM_DMA1_CH2_HT_DMA1_CH2_TC_DMA1_CH3_HT_DMA1_CH3_TC</name>
        <description>DM_DMA1_CH2_HT_DMA1_CH2_TC_DMA1_CH3_HT_DMA1_CH3_TC interrupt</description>
        <value>3</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>DMA1</name>
      <baseAddress>0x5070</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0005</offset>
        <size>5</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000b</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000f</offset>
        <size>5</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0015</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0019</offset>
        <size>5</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x001f</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0023</offset>
        <size>5</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0029</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <description>DMA1</description>
      <groupName>DMA1</groupName>
      <registers>
        <register>
          <name>GCSR</name>
          <description>DMA1 global configuration &amp; status register</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0xFC</resetValue>
          <fields>
            <field>
              <name>GEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GB</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO</name>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GIR1</name>
          <description>DMA1 global interrupt register 1</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IFC0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFC1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFC2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFC3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C0CR</name>
          <description>DMA1 channel 0 configuration register</description>
          <size>8</size>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CIRC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MINCDEC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C0SPR</name>
          <description>DMA1 channel 0 status</description>
          <size>8</size>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TCIF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSIZE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PL0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PL1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C0NDTR</name>
          <description>DMA1 number of data to transfer register (channel 0)</description>
          <size>8</size>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>NDT0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C0PARH</name>
          <description>DMA1 peripheral address high register (channel 0)</description>
          <size>8</size>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x52</resetValue>
          <fields>
            <field>
              <name>PA8</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA9</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA10</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA11</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA12</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA13</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA14</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA15</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C0PARL</name>
          <description>DMA1 peripheral address low register (channel 0)</description>
          <size>8</size>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PA0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C0M0ARH</name>
          <description>DMA1 memory 0 address high register (channel 0)</description>
          <size>8</size>
          <addressOffset>0x000B</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>M0A8</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A9</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A10</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A11</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A12</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A13</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A14</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A15</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C0M0ARL</name>
          <description>DMA1 memory 0 address low register (channel 0)</description>
          <size>8</size>
          <addressOffset>0x000C</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>M0A0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>M0A7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CR</name>
          <description>DMA1 channel 1 configuration register</description>
          <size>8</size>
          <addressOffset>0x000F</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CIRC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MINCDEC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1SPR</name>
          <description>DMA1 channel 1 status</description>
          <size>8</size>
          <addressOffset>0x0010</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TCIF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSIZE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PL0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PL1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1NDTR</name>
          <description>DMA1 number of data to transfer register (channel 1)</description>
          <size>8</size>
          <addressOffset>0x0011</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>NDT0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDT7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1PARH</name>
          <description>DMA1 peripheral address high register (channel 1)</description>
          <size>8</size>
          <addressOffset>0x0012</addressOffset>
          <resetValue>0x52</resetValue>
          <fields>
            <field>
              <name>PA8</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA9</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA10</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA11</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA12</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA13</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA14</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA15</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1PARL</name>
          <description>DMA1 peripheral address low register (channel 1)</description>
          <size>8</size>
          <addressOffset>0x0013</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PA0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
